-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Servidor: 127.0.0.1
-- Tiempo de generación: 24-04-2023 a las 14:01:23
-- Versión del servidor: 10.4.27-MariaDB
-- Versión de PHP: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de datos: `situacion_covid`
--

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `casos`
--

CREATE TABLE `casos` (
  `id` int(11) NOT NULL,
  `fecha` date NOT NULL,
  `provincia` varchar(255) NOT NULL,
  `casos_confirmados` int(11) NOT NULL,
  `nuevos_positivos` int(11) NOT NULL,
  `altas` int(11) NOT NULL,
  `fallecimientos` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_spanish_ci;

--
-- Volcado de datos para la tabla `casos`
--

INSERT INTO `casos` (`id`, `fecha`, `provincia`, `casos_confirmados`, `nuevos_positivos`, `altas`, `fallecimientos`) VALUES
(1, '2023-04-04', 'Ávila', 55724, 8, 3617, 638),
(2, '2023-04-04', 'Palencia', 67287, 12, 4405, 749),
(3, '2023-04-04', 'Salamanca', 117687, 18, 7370, 1272),
(4, '2023-04-04', 'Burgos', 128765, 6, 8067, 1168),
(5, '2023-04-04', 'Segovia', 51741, 3, 2948, 481),
(6, '2023-04-04', 'Zamora', 58029, 6, 4130, 741),
(7, '2023-04-04', 'León', 149203, 21, 10394, 1738),
(8, '2023-04-04', 'Soria', 34610, 2, 2209, 390),
(9, '2023-04-04', 'Valladolid', 195876, 12, 13079, 1762),
(10, '2023-04-03', 'Ávila', 55720, 8, 3614, 638),
(11, '2023-04-03', 'Palencia', 67275, 10, 4402, 749),
(12, '2023-04-03', 'Soria', 34607, 2, 2209, 390),
(13, '2023-04-03', 'León', 149182, 20, 10388, 1738),
(14, '2023-04-03', 'Salamanca', 117671, 7, 7367, 1272),
(15, '2023-04-03', 'Segovia', 51736, 2, 2948, 481),
(16, '2023-04-03', 'Valladolid', 195873, 10, 13076, 1762),
(17, '2023-04-03', 'Burgos', 128750, 6, 8062, 1168),
(18, '2023-04-03', 'Zamora', 58002, 5, 4130, 741),
(19, '2023-04-02', 'Burgos', 128744, 2, 8061, 1168),
(20, '2023-04-02', 'Palencia', 67265, 5, 4402, 749),
(21, '2023-04-02', 'Salamanca', 117664, 6, 7367, 1272),
(22, '2023-04-02', 'Soria', 34605, 1, 2209, 390),
(23, '2023-04-02', 'León', 149162, 5, 10387, 1738),
(24, '2023-04-02', 'Valladolid', 195863, 6, 13073, 1761),
(25, '2023-04-02', 'Zamora', 57997, 2, 4130, 741),
(26, '2023-04-02', 'Ávila', 55712, 4, 3614, 638),
(27, '2023-04-02', 'Segovia', 51734, 2, 2948, 481),
(28, '2023-04-01', 'Burgos', 128742, 2, 8060, 1167),
(29, '2023-04-01', 'Palencia', 67260, 5, 4402, 749),
(30, '2023-04-01', 'Salamanca', 117658, 4, 7367, 1272),
(31, '2023-04-01', 'Segovia', 51732, 1, 2948, 481),
(32, '2023-04-01', 'Ávila', 55708, 3, 3614, 638),
(33, '2023-04-01', 'Valladolid', 195857, 8, 13073, 1761),
(34, '2023-04-01', 'León', 149157, 6, 10386, 1738),
(35, '2023-04-01', 'Soria', 34604, 2, 2209, 390),
(36, '2023-04-01', 'Zamora', 57995, 5, 4130, 741),
(37, '2023-03-31', 'Palencia', 67255, 13, 4402, 749),
(38, '2023-03-31', 'Segovia', 51731, 2, 2946, 481),
(39, '2023-03-31', 'Soria', 34602, 3, 2209, 390),
(40, '2023-03-31', 'Valladolid', 195849, 11, 13072, 1761),
(41, '2023-03-31', 'Zamora', 57990, 27, 4128, 741),
(42, '2023-03-31', 'Ávila', 55705, 5, 3610, 638),
(43, '2023-03-31', 'Burgos', 128740, 9, 8057, 1167),
(44, '2023-03-31', 'León', 149151, 17, 10376, 1738),
(45, '2023-03-31', 'Salamanca', 117654, 22, 7363, 1272),
(46, '2023-03-30', 'León', 149122, 15, 10373, 1738),
(47, '2023-03-30', 'Palencia', 67224, 9, 4400, 749),
(48, '2023-03-30', 'Salamanca', 117635, 8, 7359, 1272),
(49, '2023-03-30', 'Soria', 34598, 3, 2209, 390),
(50, '2023-03-30', 'Zamora', 57985, 11, 4126, 741),
(51, '2023-03-30', 'Ávila', 55697, 3, 3609, 637),
(52, '2023-03-30', 'Burgos', 128731, 5, 8054, 1167),
(53, '2023-03-30', 'Segovia', 51729, 2, 2946, 481),
(54, '2023-03-30', 'Valladolid', 195824, 9, 13070, 1761),
(55, '2023-03-29', 'Burgos', 128726, 18, 8053, 1167),
(56, '2023-03-29', 'Soria', 34595, 5, 2206, 390),
(57, '2023-03-29', 'Valladolid', 195815, 18, 13070, 1761),
(58, '2023-03-29', 'Zamora', 57974, 24, 4123, 740),
(59, '2023-03-29', 'Ávila', 55694, 5, 3609, 637),
(60, '2023-03-29', 'León', 149107, 19, 10368, 1738),
(61, '2023-03-29', 'Palencia', 67215, 38, 4399, 749),
(62, '2023-03-29', 'Salamanca', 117627, 20, 7354, 1272),
(63, '2023-03-29', 'Segovia', 51727, 6, 2946, 481),
(64, '2023-03-28', 'Ávila', 55689, 9, 3604, 637),
(65, '2023-03-28', 'Salamanca', 117607, 15, 7349, 1272),
(66, '2023-03-28', 'Burgos', 128708, 9, 8051, 1167),
(67, '2023-03-28', 'León', 149088, 19, 10363, 1738),
(68, '2023-03-28', 'Palencia', 67177, 31, 4399, 749),
(69, '2023-03-28', 'Segovia', 51721, 3, 2946, 481),
(70, '2023-03-28', 'Soria', 34590, 2, 2205, 390),
(71, '2023-03-28', 'Valladolid', 195797, 28, 13064, 1761),
(72, '2023-03-28', 'Zamora', 57950, 14, 4123, 740),
(73, '2023-03-27', 'León', 149061, 18, 10363, 1738),
(74, '2023-03-27', 'Segovia', 51710, 3, 2945, 481),
(75, '2023-03-27', 'Burgos', 128699, 7, 8046, 1166),
(76, '2023-03-27', 'Palencia', 67144, 30, 4398, 749),
(77, '2023-03-27', 'Salamanca', 117579, 12, 7347, 1272),
(78, '2023-03-27', 'Valladolid', 195771, 19, 13059, 1759),
(79, '2023-03-27', 'Ávila', 55679, 9, 3603, 637),
(80, '2023-03-27', 'Soria', 34588, 2, 2202, 390),
(81, '2023-03-27', 'Zamora', 57940, 9, 4123, 740),
(82, '2023-03-26', 'Palencia', 67114, 26, 4398, 749),
(83, '2023-03-26', 'León', 149043, 5, 10362, 1737),
(84, '2023-03-26', 'Salamanca', 117567, 2, 7347, 1272),
(85, '2023-03-26', 'Segovia', 51707, 1, 2945, 481),
(86, '2023-03-26', 'Soria', 34586, 5, 2202, 390),
(87, '2023-03-26', 'Valladolid', 195752, 2, 13059, 1759),
(88, '2023-03-26', 'Zamora', 57931, 6, 4122, 739),
(89, '2023-03-26', 'Ávila', 55670, 5, 3603, 637),
(90, '2023-03-26', 'Burgos', 128692, 1, 8046, 1166),
(91, '2023-03-25', 'Ávila', 55665, 1, 3602, 636),
(92, '2023-03-25', 'Burgos', 128691, 3, 8045, 1166),
(93, '2023-03-25', 'Palencia', 67088, 12, 4398, 749),
(94, '2023-03-25', 'Segovia', 51706, 2, 2945, 481),
(95, '2023-03-25', 'Soria', 34581, 2, 2202, 390),
(96, '2023-03-25', 'Valladolid', 195750, 7, 13057, 1758),
(97, '2023-03-25', 'León', 149038, 12, 10361, 1737),
(98, '2023-03-25', 'Salamanca', 117565, 4, 7343, 1271),
(99, '2023-03-25', 'Zamora', 57925, 6, 4121, 738),
(100, '2023-03-24', 'León', 149026, 27, 10357, 1737);

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `resumen`
--

CREATE TABLE `resumen` (
  `id` int(11) NOT NULL,
  `fecha` date NOT NULL,
  `resumen` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_spanish_ci;

--
-- Índices para tablas volcadas
--

--
-- Indices de la tabla `casos`
--
ALTER TABLE `casos`
  ADD PRIMARY KEY (`id`);

--
-- Indices de la tabla `resumen`
--
ALTER TABLE `resumen`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT de las tablas volcadas
--

--
-- AUTO_INCREMENT de la tabla `casos`
--
ALTER TABLE `casos`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT de la tabla `resumen`
--
ALTER TABLE `resumen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
